AlmAck/svdtonuttx/demo/h/da1470x_dma.h
/* Register addresses *******************************************************/

#define DA1470X_DMA_BASE                       0x51000400 /* DMA registers */

#define DA1470X_DMA_DMA0_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_A_START_OFFSET) /* Source address register of DMA channel 0 */
#define DA1470X_DMA_DMA0_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_B_START_OFFSET) /* Destination address register of DMA channel 0 */
#define DA1470X_DMA_DMA0_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_CTRL_OFFSET) /* Control register of DMA channel 0 */
#define DA1470X_DMA_DMA0_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_IDX_OFFSET) /* Index pointer register of DMA channel 0 */
#define DA1470X_DMA_DMA0_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_INT_OFFSET) /* Interrupt length register of DMA channel 0 */
#define DA1470X_DMA_DMA0_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA0_LEN_OFFSET) /* Transfer length register of DMA channel 0 */
#define DA1470X_DMA_DMA1_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_A_START_OFFSET) /* Source address register of DMA channel 1 */
#define DA1470X_DMA_DMA1_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_B_START_OFFSET) /* Destination address register of DMA channel 1 */
#define DA1470X_DMA_DMA1_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_CTRL_OFFSET) /* Control register of DMA channel 1 */
#define DA1470X_DMA_DMA1_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_IDX_OFFSET) /* Index pointer register of DMA channel 1 */
#define DA1470X_DMA_DMA1_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_INT_OFFSET) /* Interrupt length register of DMA channel 1 */
#define DA1470X_DMA_DMA1_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA1_LEN_OFFSET) /* Transfer length register of DMA channel 1 */
#define DA1470X_DMA_DMA2_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_A_START_OFFSET) /* Source address register of DMA channel 2 */
#define DA1470X_DMA_DMA2_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_B_START_OFFSET) /* Destination address register of DMA channel 2 */
#define DA1470X_DMA_DMA2_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_CTRL_OFFSET) /* Control register of DMA channel 2 */
#define DA1470X_DMA_DMA2_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_IDX_OFFSET) /* Index pointer register of DMA channel 2 */
#define DA1470X_DMA_DMA2_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_INT_OFFSET) /* Interrupt length register of DMA channel 2 */
#define DA1470X_DMA_DMA2_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA2_LEN_OFFSET) /* Transfer length register of DMA channel 2 */
#define DA1470X_DMA_DMA3_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_A_START_OFFSET) /* Source address register of DMA channel 3 */
#define DA1470X_DMA_DMA3_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_B_START_OFFSET) /* Destination address register of DMA channel 3 */
#define DA1470X_DMA_DMA3_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_CTRL_OFFSET) /* Control register of DMA channel 3 */
#define DA1470X_DMA_DMA3_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_IDX_OFFSET) /* Index pointer register of DMA channel 3 */
#define DA1470X_DMA_DMA3_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_INT_OFFSET) /* Interrupt length register of DMA channel 3 */
#define DA1470X_DMA_DMA3_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA3_LEN_OFFSET) /* Transfer length register of DMA channel 3 */
#define DA1470X_DMA_DMA4_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_A_START_OFFSET) /* Source address register of DMA channel 4 */
#define DA1470X_DMA_DMA4_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_B_START_OFFSET) /* Destination address register of DMA channel 4 */
#define DA1470X_DMA_DMA4_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_CTRL_OFFSET) /* Control register of DMA channel 4 */
#define DA1470X_DMA_DMA4_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_IDX_OFFSET) /* Index pointer register of DMA channel 4 */
#define DA1470X_DMA_DMA4_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_INT_OFFSET) /* Interrupt length register of DMA channel 4 */
#define DA1470X_DMA_DMA4_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA4_LEN_OFFSET) /* Transfer length register of DMA channel 4 */
#define DA1470X_DMA_DMA5_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_A_START_OFFSET) /* Source address register of DMA channel 5 */
#define DA1470X_DMA_DMA5_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_B_START_OFFSET) /* Destination address register of DMA channel 5 */
#define DA1470X_DMA_DMA5_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_CTRL_OFFSET) /* Control register of DMA channel 5 */
#define DA1470X_DMA_DMA5_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_IDX_OFFSET) /* Index pointer register of DMA channel 5 */
#define DA1470X_DMA_DMA5_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_INT_OFFSET) /* Interrupt length register of DMA channel 5 */
#define DA1470X_DMA_DMA5_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA5_LEN_OFFSET) /* Transfer length register of DMA channel 5 */
#define DA1470X_DMA_DMA6_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_A_START_OFFSET) /* Source address register of DMA channel 6 */
#define DA1470X_DMA_DMA6_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_B_START_OFFSET) /* Destination address register of DMA channel 6 */
#define DA1470X_DMA_DMA6_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_CTRL_OFFSET) /* Control register of DMA channel 6 */
#define DA1470X_DMA_DMA6_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_IDX_OFFSET) /* Index pointer register of DMA channel 6 */
#define DA1470X_DMA_DMA6_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_INT_OFFSET) /* Interrupt length register of DMA channel 6 */
#define DA1470X_DMA_DMA6_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA6_LEN_OFFSET) /* Transfer length register of DMA channel 6 */
#define DA1470X_DMA_DMA7_A_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_A_START_OFFSET) /* Source address register of DMA channel 7 */
#define DA1470X_DMA_DMA7_B_START               (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_B_START_OFFSET) /* Destination address register of DMA channel 7 */
#define DA1470X_DMA_DMA7_CTRL                  (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_CTRL_OFFSET) /* Control register of DMA channel 7 */
#define DA1470X_DMA_DMA7_IDX                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_IDX_OFFSET) /* Index pointer register of DMA channel 7 */
#define DA1470X_DMA_DMA7_INT                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_INT_OFFSET) /* Interrupt length register of DMA channel 7 */
#define DA1470X_DMA_DMA7_LEN                   (DA1470X_DMA_BASE + DA1470X_DMA_DMA7_LEN_OFFSET) /* Transfer length register of DMA channel 7 */
#define DA1470X_DMA_DMA_CLEAR_INT              (DA1470X_DMA_BASE + DA1470X_DMA_DMA_CLEAR_INT_OFFSET) /* DMA Interrupt clear register */
#define DA1470X_DMA_DMA_INT_MASK               (DA1470X_DMA_BASE + DA1470X_DMA_DMA_INT_MASK_OFFSET) /* DMA Interrupt mask register */
#define DA1470X_DMA_DMA_INT_STATUS             (DA1470X_DMA_BASE + DA1470X_DMA_DMA_INT_STATUS_OFFSET) /* DMA Interrupt status register */
#define DA1470X_DMA_DMA_REQ_MUX                (DA1470X_DMA_BASE + DA1470X_DMA_DMA_REQ_MUX_OFFSET) /* DMA channels peripherals mapping register */
#define DA1470X_DMA_DMA_RESET_INT_MASK         (DA1470X_DMA_BASE + DA1470X_DMA_DMA_RESET_INT_MASK_OFFSET) /* DMA Reset Interrupt mask register */
#define DA1470X_DMA_DMA_SET_INT_MASK           (DA1470X_DMA_BASE + DA1470X_DMA_DMA_SET_INT_MASK_OFFSET) /* DMA Set Interrupt mask register */

/* Register bit definitions *************************************************/


/* DMA0_A_START Register */

#define DMA_DMA0_A_START_MASK                  (0xFFFFFFFF << 0) /* Source start address of channel 0 */
#define DMA_DMA0_A_START_POS                   (0) /* Source start address of channel 0 */

/* DMA0_B_START Register */

#define DMA_DMA0_B_START_MASK                  (0xFFFFFFFF << 0) /* Destination start address of channel 0 */
#define DMA_DMA0_B_START_POS                   (0) /* Destination start address of channel 0 */

/* DMA0_CTRL Register */

#define DMA_DMA_EXCLUSIVE_ACCESS               (1U << 16) /* 0: DMA channel de-asserts the bus request upon completion of the write transfer  */
#define DMA_BUS_ERROR_DETECT                   (1U << 15) /* 0: Ignores bus error response from the AHB bus, so DMA continues normally. 1: De */
#define DMA_BURST_MODE_MASK                    (0x3 << 13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_BURST_MODE_POS                     (13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_REQ_SENSE                          (1U << 12) /* 0: DMA operates with level-sensitive peripheral requests (default) 1: DMA operat */
#define DMA_DMA_INIT                           (1U << 11) /* 0: DMA performs copy A1 to B1, A2 to B2, and so on ... 1: DMA performs copy of A */
#define DMA_DMA_IDLE                           (1U << 10) /* 0: Blocking mode, the DMA performs a fast back-to-back copy, disabling bus acces */
#define DMA_DMA_PRIO_MASK                      (0x7 << 7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_DMA_PRIO_POS                       (7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_CIRCULAR                           (1U << 6) /* 0: Normal mode. The DMA channel stops after having completed the transfer of len */
#define DMA_AINC                               (1U << 5) /* Enable increment of source address. 0 = do not increment (source address stays t */
#define DMA_BINC                               (1U << 4) /* Enable increment of destination address. 0 = do not increment (destination addre */
#define DMA_DREQ_MODE                          (1U << 3) /* 0: DMA channel starts immediately 1: DMA channel must be triggered by peripheral */
#define DMA_BW_MASK                            (0x3 << 1) /* Bus transfer width: 00 = 1 B (suggested for peripherals like UART and 8-bit SPI) */
#define DMA_BW_POS                             (1) /* Bus transfer width: 00 = 1 B (suggested for peripherals like UART and 8-bit SPI) */
#define DMA_DMA_ON                             (1U << 0) /* 0: DMA channel is off, clocks are disabled 1: DMA channel is enabled. This bit w */

/* DMA0_IDX Register */

#define DMA_DMA0_IDX_MASK                      (0xFFFF << 0) /* This (read-only) register determines the data items already transferred by the D */
#define DMA_DMA0_IDX_POS                       (0) /* This (read-only) register determines the data items already transferred by the D */

/* DMA0_INT Register */

#define DMA_DMA0_INT_MASK                      (0xFFFF << 0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */
#define DMA_DMA0_INT_POS                       (0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */

/* DMA0_LEN Register */

#define DMA_DMA0_LEN_MASK                      (0xFFFF << 0) /* DMA channel's transfer length. DMA0_LEN of value 0, 1, 2, ... results into an ac */
#define DMA_DMA0_LEN_POS                       (0) /* DMA channel's transfer length. DMA0_LEN of value 0, 1, 2, ... results into an ac */

/* DMA1_A_START Register */

#define DMA_DMA1_A_START_MASK                  (0xFFFFFFFF << 0) /* Source start address of channel 1 */
#define DMA_DMA1_A_START_POS                   (0) /* Source start address of channel 1 */

