AlmAck/svdtonuttx/demo/h/da1470x_dma.h
/* DMA2_LEN Register */

#define DMA_DMA2_LEN_MASK                      (0xFFFF << 0) /* DMA channel's transfer length. DMA2_LEN of value 0, 1, 2, ... results into an ac */
#define DMA_DMA2_LEN_POS                       (0) /* DMA channel's transfer length. DMA2_LEN of value 0, 1, 2, ... results into an ac */

/* DMA3_A_START Register */

#define DMA_DMA3_A_START_MASK                  (0xFFFFFFFF << 0) /* Source start address of channel 3 */
#define DMA_DMA3_A_START_POS                   (0) /* Source start address of channel 3 */

/* DMA3_B_START Register */

#define DMA_DMA3_B_START_MASK                  (0xFFFFFFFF << 0) /* Destination start address of channel 3 */
#define DMA_DMA3_B_START_POS                   (0) /* Destination start address of channel 3 */

/* DMA3_CTRL Register */

#define DMA_DMA_EXCLUSIVE_ACCESS               (1U << 16) /* 0: DMA channel de-asserts the bus request upon completion of the write transfer  */
#define DMA_BUS_ERROR_DETECT                   (1U << 15) /* 0: Ignores bus error response from the AHB bus, so DMA continues normally. 1: De */
#define DMA_BURST_MODE_MASK                    (0x3 << 13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_BURST_MODE_POS                     (13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_REQ_SENSE                          (1U << 12) /* 0: DMA operates with level-sensitive peripheral requests (default) 1: DMA operat */
#define DMA_DMA_INIT                           (1U << 11) /* 0: DMA performs copy A1 to B1, A2 to B2, and so on ... 1: DMA performs copy of A */
#define DMA_DMA_IDLE                           (1U << 10) /* 0: Blocking mode, the DMA performs a fast back-to-back copy, disabling bus acces */
#define DMA_DMA_PRIO_MASK                      (0x7 << 7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_DMA_PRIO_POS                       (7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_CIRCULAR                           (1U << 6) /* 0: Normal mode. The DMA channel stops after having completed the transfer of len */
#define DMA_AINC                               (1U << 5) /* Enable increment of source address. 0 = do not increment (source address stays t */
#define DMA_BINC                               (1U << 4) /* Enable increment of destination address. 0 = do not increment (destination addre */
#define DMA_DREQ_MODE                          (1U << 3) /* 0: DMA channel starts immediately 1: DMA channel must be triggered by peripheral */
#define DMA_BW_MASK                            (0x3 << 1) /* Bus transfer width: 00 = 1 Byte (suggested for peripherals like UART and 8-bit S */
#define DMA_BW_POS                             (1) /* Bus transfer width: 00 = 1 Byte (suggested for peripherals like UART and 8-bit S */
#define DMA_DMA_ON                             (1U << 0) /* 0: DMA channel is off, clocks are disabled 1: DMA channel is enabled. This bit w */

/* DMA3_IDX Register */

#define DMA_DMA3_IDX_MASK                      (0xFFFF << 0) /* This (read-only) register determines the data items already transferred by the D */
#define DMA_DMA3_IDX_POS                       (0) /* This (read-only) register determines the data items already transferred by the D */

/* DMA3_INT Register */

#define DMA_DMA3_INT_MASK                      (0xFFFF << 0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */
#define DMA_DMA3_INT_POS                       (0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */

/* DMA3_LEN Register */

#define DMA_DMA3_LEN_MASK                      (0xFFFF << 0) /* DMA channel's transfer length. DMA3_LEN of value 0, 1, 2, ... results into an ac */
#define DMA_DMA3_LEN_POS                       (0) /* DMA channel's transfer length. DMA3_LEN of value 0, 1, 2, ... results into an ac */

/* DMA4_A_START Register */

#define DMA_DMA4_A_START_MASK                  (0xFFFFFFFF << 0) /* Source start address of channel 4 */
#define DMA_DMA4_A_START_POS                   (0) /* Source start address of channel 4 */

/* DMA4_B_START Register */

#define DMA_DMA4_B_START_MASK                  (0xFFFFFFFF << 0) /* Destination start address of channel 4 */
#define DMA_DMA4_B_START_POS                   (0) /* Destination start address of channel 4 */

/* DMA4_CTRL Register */

#define DMA_DMA_EXCLUSIVE_ACCESS               (1U << 16) /* 0: DMA channel de-asserts the bus request upon completion of the write transfer  */
#define DMA_BUS_ERROR_DETECT                   (1U << 15) /* 0: Ignores bus error response from the AHB bus, so DMA continues normally. 1: De */
#define DMA_BURST_MODE_MASK                    (0x3 << 13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_BURST_MODE_POS                     (13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_REQ_SENSE                          (1U << 12) /* 0: DMA operates with level-sensitive peripheral requests (default) 1: DMA operat */
#define DMA_DMA_INIT                           (1U << 11) /* 0: DMA performs copy A1 to B1, A2 to B2, and so on ... 1: DMA performs copy of A */
#define DMA_DMA_IDLE                           (1U << 10) /* 0: Blocking mode, the DMA performs a fast back-to-back copy, disabling bus acces */
#define DMA_DMA_PRIO_MASK                      (0x7 << 7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_DMA_PRIO_POS                       (7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_CIRCULAR                           (1U << 6) /* 0: Normal mode. The DMA channel stops after having completed the transfer of len */
#define DMA_AINC                               (1U << 5) /* Enable increment of source address. 0 = do not increment (source address stays t */
#define DMA_BINC                               (1U << 4) /* Enable increment of destination address. 0 = do not increment (destination addre */
#define DMA_DREQ_MODE                          (1U << 3) /* 0: DMA channel starts immediately 1: DMA channel must be triggered by peripheral */
#define DMA_BW_MASK                            (0x3 << 1) /* Bus transfer width: 00 = 1 B (suggested for peripherals like UART and 8-bit SPI) */
#define DMA_BW_POS                             (1) /* Bus transfer width: 00 = 1 B (suggested for peripherals like UART and 8-bit SPI) */
#define DMA_DMA_ON                             (1U << 0) /* 0: DMA channel is off, clocks are disabled 1: DMA channel is enabled. This bit w */

/* DMA4_IDX Register */

#define DMA_DMA4_IDX_MASK                      (0xFFFF << 0) /* This (read-only) register determines the data items already transferred by the D */
#define DMA_DMA4_IDX_POS                       (0) /* This (read-only) register determines the data items already transferred by the D */

/* DMA4_INT Register */

#define DMA_DMA4_INT_MASK                      (0xFFFF << 0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */
#define DMA_DMA4_INT_POS                       (0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */

