AlmAck/svdtonuttx/demo/h/da1470x_dma.h
#define DMA_DMA7_B_START_MASK                  (0xFFFFFFFF << 0) /* Destination start address of channel 7 */
#define DMA_DMA7_B_START_POS                   (0) /* Destination start address of channel 7 */

/* DMA7_CTRL Register */

#define DMA_DMA_EXCLUSIVE_ACCESS               (1U << 16) /* 0: DMA channel de-asserts the bus request upon completion of the write transfer  */
#define DMA_BUS_ERROR_DETECT                   (1U << 15) /* 0: Ignores bus error response from the AHB bus, so DMA continues normally. 1: De */
#define DMA_BURST_MODE_MASK                    (0x3 << 13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_BURST_MODE_POS                     (13) /* Enables the DMA read/write bursts, according to the following configuration: 00  */
#define DMA_REQ_SENSE                          (1U << 12) /* 0: DMA operates with level-sensitive peripheral requests (default) 1: DMA operat */
#define DMA_DMA_INIT                           (1U << 11) /* 0: DMA performs copy A1 to B1, A2 to B2, and so on ... 1: DMA performs copy of A */
#define DMA_DMA_IDLE                           (1U << 10) /* 0: Blocking mode, the DMA performs a fast back-to-back copy, disabling bus acces */
#define DMA_DMA_PRIO_MASK                      (0x7 << 7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_DMA_PRIO_POS                       (7) /* The priority level determines which DMA channel will be granted access for trans */
#define DMA_CIRCULAR                           (1U << 6) /* 0: Normal mode. The DMA channel stops after having completed the transfer of len */
#define DMA_AINC                               (1U << 5) /* Enable increment of source address. 0 = do not increment (source address stays t */
#define DMA_BINC                               (1U << 4) /* Enable increment of destination address. 0 = do not increment (destination addre */
#define DMA_DREQ_MODE                          (1U << 3) /* 0: DMA channel starts immediately 1: DMA channel must be triggered by peripheral */
#define DMA_BW_MASK                            (0x3 << 1) /* Bus transfer width: 00 = 1 Byte (suggested for peripherals like UART and 8-bit S */
#define DMA_BW_POS                             (1) /* Bus transfer width: 00 = 1 Byte (suggested for peripherals like UART and 8-bit S */
#define DMA_DMA_ON                             (1U << 0) /* 0: DMA channel is off, clocks are disabled 1: DMA channel is enabled. This bit w */

/* DMA7_IDX Register */

#define DMA_DMA7_IDX_MASK                      (0xFFFF << 0) /* This (read-only) register determines the data items already transferred by the D */
#define DMA_DMA7_IDX_POS                       (0) /* This (read-only) register determines the data items already transferred by the D */

/* DMA7_INT Register */

#define DMA_DMA7_INT_MASK                      (0xFFFF << 0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */
#define DMA_DMA7_INT_POS                       (0) /* Number of transfers until an interrupt is generated. The interrupt is generated  */

/* DMA7_LEN Register */

#define DMA_DMA7_LEN_MASK                      (0xFFFF << 0) /* DMA channel's transfer length. DMA7_LEN of value 0, 1, 2, ... results into an ac */
#define DMA_DMA7_LEN_POS                       (0) /* DMA channel's transfer length. DMA7_LEN of value 0, 1, 2, ... results into an ac */

/* DMA_CLEAR_INT Register */

#define DMA_DMA_RST_IRQ_CH7                    (1U << 7) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 7 ; writ */
#define DMA_DMA_RST_IRQ_CH6                    (1U << 6) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 6 ; writ */
#define DMA_DMA_RST_IRQ_CH5                    (1U << 5) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 5 ; writ */
#define DMA_DMA_RST_IRQ_CH4                    (1U << 4) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 4 ; writ */
#define DMA_DMA_RST_IRQ_CH3                    (1U << 3) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 3 ; writ */
#define DMA_DMA_RST_IRQ_CH2                    (1U << 2) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 2 ; writ */
#define DMA_DMA_RST_IRQ_CH1                    (1U << 1) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 1 ; writ */
#define DMA_DMA_RST_IRQ_CH0                    (1U << 0) /* Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 0 ; writ */

/* DMA_INT_MASK Register */

#define DMA_DMA_IRQ_ENABLE7                    (1U << 7) /* 0: disable interrupts on channel 7 1: enable interrupts on channel 7 */
#define DMA_DMA_IRQ_ENABLE6                    (1U << 6) /* 0: disable interrupts on channel 6 1: enable interrupts on channel 6 */
#define DMA_DMA_IRQ_ENABLE5                    (1U << 5) /* 0: disable interrupts on channel 5 1: enable interrupts on channel 5 */
#define DMA_DMA_IRQ_ENABLE4                    (1U << 4) /* 0: disable interrupts on channel 4 1: enable interrupts on channel 4 */
#define DMA_DMA_IRQ_ENABLE3                    (1U << 3) /* 0: disable interrupts on channel 3 1: enable interrupts on channel 3 */
#define DMA_DMA_IRQ_ENABLE2                    (1U << 2) /* 0: disable interrupts on channel 2 1: enable interrupts on channel 2 */
#define DMA_DMA_IRQ_ENABLE1                    (1U << 1) /* 0: disable interrupts on channel 1 1: enable interrupts on channel 1 */
#define DMA_DMA_IRQ_ENABLE0                    (1U << 0) /* 0: disable interrupts on channel 0 1: enable interrupts on channel 0 */

/* DMA_INT_STATUS Register */

#define DMA_DMA_BUS_ERR7                       (1U << 15) /* 0: No bus error response is detected for channel 7 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR6                       (1U << 14) /* 0: No bus error response is detected for channel 6 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR5                       (1U << 13) /* 0: No bus error response is detected for channel 5 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR4                       (1U << 12) /* 0: No bus error response is detected for channel 4 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR3                       (1U << 11) /* 0: No bus error response is detected for channel 3 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR2                       (1U << 10) /* 0: No bus error response is detected for channel 2 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR1                       (1U << 9) /* 0: No bus error response is detected for channel 1 1: Bus error response detecte */
#define DMA_DMA_BUS_ERR0                       (1U << 8) /* 0: No bus error response is detected for channel 0 1: Bus error response detecte */
#define DMA_DMA_IRQ_CH7                        (1U << 7) /* 0: IRQ on channel 7 is not set 1: IRQ on channel 7 is set */
#define DMA_DMA_IRQ_CH6                        (1U << 6) /* 0: IRQ on channel 6 is not set 1: IRQ on channel 6 is set */
#define DMA_DMA_IRQ_CH5                        (1U << 5) /* 0: IRQ on channel 5 is not set 1: IRQ on channel 5 is set */
#define DMA_DMA_IRQ_CH4                        (1U << 4) /* 0: IRQ on channel 4 is not set 1: IRQ on channel 4 is set */
#define DMA_DMA_IRQ_CH3                        (1U << 3) /* 0: IRQ on channel 3 is not set 1: IRQ on channel 3 is set */
#define DMA_DMA_IRQ_CH2                        (1U << 2) /* 0: IRQ on channel 2 is not set 1: IRQ on channel 2 is set */
#define DMA_DMA_IRQ_CH1                        (1U << 1) /* 0: IRQ on channel 1 is not set 1: IRQ on channel 1 is set */
#define DMA_DMA_IRQ_CH0                        (1U << 0) /* 0: IRQ on channel 0 is not set 1: IRQ on channel 0 is set */

/* DMA_REQ_MUX Register */

