AlmAck/svdtonuttx/demo/h/da1470x_dma.h
#define DMA_DMA67_SEL_MASK                     (0xF << 12) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA67_SEL_POS                      (12) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA45_SEL_MASK                     (0xF << 8) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA45_SEL_POS                      (8) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA23_SEL_MASK                     (0xF << 4) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA23_SEL_POS                      (4) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA01_SEL_MASK                     (0xF << 0) /* Select which combination of peripherals are mapped on the DMA channels. The peri */
#define DMA_DMA01_SEL_POS                      (0) /* Select which combination of peripherals are mapped on the DMA channels. The peri */

/* DMA_RESET_INT_MASK Register */

#define DMA_DMA_RESET_IRQ_ENABLE7              (1U << 7) /* Writing a 1 will disable the IRQs in the DMA channel 7, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE6              (1U << 6) /* Writing a 1 will disable the IRQs in the DMA channel 6, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE5              (1U << 5) /* Writing a 1 will disable the IRQs in the DMA channel 5, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE4              (1U << 4) /* Writing a 1 will disable the IRQs in the DMA channel 4, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE3              (1U << 3) /* Writing a 1 will disable the IRQs in the DMA channel 3, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE2              (1U << 2) /* Writing a 1 will disable the IRQs in the DMA channel 2, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE1              (1U << 1) /* Writing a 1 will disable the IRQs in the DMA channel 1, writing a 0 has no effec */
#define DMA_DMA_RESET_IRQ_ENABLE0              (1U << 0) /* Writing a 1 will disable the IRQs in the DMA channel 0, writing a 0 has no effec */

/* DMA_SET_INT_MASK Register */

#define DMA_DMA_SET_IRQ_ENABLE7                (1U << 7) /* Writing a 1 will enable the IRQs in the DMA channel 7, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE6                (1U << 6) /* Writing a 1 will enable the IRQs in the DMA channel 6, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE5                (1U << 5) /* Writing a 1 will enable the IRQs in the DMA channel 5, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE4                (1U << 4) /* Writing a 1 will enable the IRQs in the DMA channel 4, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE3                (1U << 3) /* Writing a 1 will enable the IRQs in the DMA channel 3, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE2                (1U << 2) /* Writing a 1 will enable the IRQs in the DMA channel 2, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE1                (1U << 1) /* Writing a 1 will enable the IRQs in the DMA channel 1, writing a 0 has no effect */
#define DMA_DMA_SET_IRQ_ENABLE0                (1U << 0) /* Writing a 1 will enable the IRQs in the DMA channel 0, writing a 0 has no effect */

#endif /* __DA1470X_DMA_H */
